# Room Property

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
Mullion..::..Room Property
Mullion Class See Also
---
The room in which the instance is located.
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Room | The room in which the instance is located (during the last phase of the project). (Inherited from FamilyInstance.) |
| [Room[([( Phase])]) ](5c1ed572-e744-3ab6-9b10-bb258a66f23a.md "Room Property \(Phase\)") | (Inherited from FamilyInstance.) |

# See Also
Mullion Class
Mullion Members
Autodesk.Revit.DB Namespace